app/controllers/cidades_controller.rb

  def index
    @cidades = Cidade.all
---
SELECT * FROM "cidades"

  def show
    @cidade = Cidade.find(params[:id])
---
SELECT * FROM "cidades" WHERE ("cidades"."id" = 1)

  def edit
    @cidade = Cidade.find(params[:id])
---
SELECT * FROM "cidades" WHERE ("cidades"."id" = 1)

  def create
    @cidade = Cidade.new(params[:cidade])

    respond_to do |format|
      if @cidade.save
---
INSERT INTO "cidades" ("created_at", "nome", "updated_at", "uf") VALUES('2009-05-14 15:26:10', 'Iguatu', '2009-05-14 15:26:10', 'CE')

  def update
    @cidade = Cidade.find(params[:id])

    respond_to do |format|
      if @cidade.update_attributes(params[:cidade])
---
SELECT * FROM "cidades" WHERE ("cidades"."id" = 1)
UPDATE "cidades" SET "updated_at" = '2009-05-14 15:28:58', "nome" = 'Acopiara' WHERE "id" = 1