app/controllers/pessoas_controller.rb

SELECT * FROM "pessoas"
---
  def index
    @pessoas = Pessoa.all

SELECT * FROM "pessoas" WHERE ("pessoas"."id" = 0)
---
  def show
    @pessoa = Pessoa.find(params[:id])

SELECT * FROM "pessoas" WHERE ("pessoas"."id" = 1)
---
  def edit
    @pessoa = Pessoa.find(params[:id])

INSERT INTO "pessoas" ("endereco", "created_at", "nome", "updated_at") VALUES('Rua Sicrano, 32', '2009-05-14 14:29:42', 'Fulano de Tal', '2009-05-14 14:29:42')
---
  def create
    @pessoa = Pessoa.new(params[:pessoa])

    respond_to do |format|
      if @pessoa.save

SELECT * FROM "pessoas" WHERE ("pessoas"."id" = 1)
UPDATE "pessoas" SET "updated_at" = '2009-05-14 15:21:10', "nome" = 'Sicrano de Tal' WHERE "id" = 1
---
  def update
    @pessoa = Pessoa.find(params[:id])

    respond_to do |format|
      if @pessoa.update_attributes(params[:pessoa])